W6D3/routes_controller/app/controllers/artwork_shares_controller.rb

    def index
        render json: ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def create
        @artwork_share = ArtworkShare.new(require_artwork_share)
        if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 3], ["created_at", "2022-09-15 21:18:11.424419"], ["updated_at", "2022-09-15 21:18:11.424419"]]

    def destroy
        @artwork_share = ArtworkShare.find_by(id: params[:id])
        if @artwork_share.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]