W6D3/routes_controller/app/controllers/artworks_controller.rb

    def create
        @artwork = Artwork.new(require_artwork)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "train"], ["image_url", nil], ["artist_id", 3], ["created_at", "2022-09-15 19:13:12.755061"], ["updated_at", "2022-09-15 19:13:12.755061"]]

    def destroy
        @artwork = Artwork.find_by(id: params[:id])
        if @artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]

    def show
        @artwork = Artwork.find_by(id: params[:id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        @artwork = Artwork.find_by(id: params[:id])
        if @artwork.update(require_artwork)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "bullettrain"], ["updated_at", "2022-09-15 19:14:04.880358"], ["id", 4]]