W6D3/routes_controller/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", nil], ["author_id", 3], ["artwork_id", 1], ["created_at", "2022-09-15 23:40:42.817771"], ["updated_at", "2022-09-15 23:40:42.817771"]]
---
    def create
        @comment = Comment.new(require_comment)
        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @comment = Comment.find_by(id: params[:id])