W6D3/routes_controller/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-09-15 18:35:53.094206"], ["updated_at", "2022-09-15 18:35:53.094206"], ["username", "Tom"]]
---
    def create
        @user = User.new(require_user)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
    def destroy
        @user = User.find_by(id: params[:id])
         if @user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "username" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-09-15 18:57:07.763446"], ["username", "jack"], ["id", 8]]
---
    def update
        @user = User.find_by(id: params[:id])
        if @user.update(require_user)